//=============================================================================
//
// ゲージ画面処理 [gauge.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct GAUGE
{
	BOOL			use;					// TRUE:使っている  FALSE:未使用
	float			w, h;					// 幅と高さ
	XMFLOAT3		pos;					// ポリゴンの座標
	int				texNo;					// テクスチャ番号
};

enum
{
	GAUGE_BAD,
	GAUGE_NORMAL,
	GAUGE_GOOD,
	GAUGE_MAX,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGauge(void);
void UninitGauge(void);
void UpdateGauge(void);
void DrawGauge(void);


