//=============================================================================
//
// エネミー処理 [enemy.h]
// 作成者 : GP11A132 11 蔡文権
// 作成日 : 2023 / 12 / 06
//=============================================================================
#pragma once
#include "model.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TATE		(4)					// 建物の数
#define TATE_SIZE		(10.0f)				// 建物のサイズ

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct TATE
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				spd;				// 移動スピード
	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	int					particleIdx;		// 効果のカウント用Index
	int					count;				// カウント用変数

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTate(void);
void UninitTate(void);
void UpdateTate(void);
void DrawTate(void);

TATE *GetTate(void);
int GetLevel(void);

